g = 9.80665
c = 299792458
G = 6.67430e-11  # Гравитационная постоянная (м³·кг⁻¹·с⁻²)
k = 8.9875517923e9  # Постоянная Кулона (Н·м²·Кл⁻²)
h = 6.62607015e-34  # Постоянная Планка (Дж·с)
e = -1.602176634e-19
proton = 1.602176634e-19

class Density:
    """Плотность веществ (кг/м³)"""
    water = 1000
    ice = 917
    air = 1.225
    steel = 7850
    aluminum = 2700
    gold = 19300
    mercury = 13593
    oil = 900
    wood = 700
    concrete = 2400

class Energy:
    """Энергии (Дж)"""
    electron_volt = 1.602176634e-19
    planck = 6.62607015e-34

class Mass:
    """Массы (кг)"""
    electron = 9.1093837015e-31
    proton = 1.67262192369e-27
    neutron = 1.67492749804e-27
